{
  "bio": {
    "image": "media/HeroImage.jpg",
    "name": "Fast Code",
    "roles": [
      "Программист",
      "Backend разработчик",
      "Python senior разработчик"
    ],
    "description": "В свободное время занимаюсь OpenSource проектами и веду IT-канал, где делюсь опытом и знаниями. Предпочитаю использовать NeoVim для разработки, что помогает мне глубже понимать процессы и улучшать навыки. Готов к сложным задачам и постоянному профессиональному росту. \nIT-канал: Веду канал в Telegram: https://t.me/it_fastteam.",
    "kwork": "https://kwork.ru/user/fast_code",
    "github": "https://github.com/ProFastCode",
    "telegram": "https://t.me/ProFastCode",
    "resume": "resume.pdf"
  },
  "skills": [
    {
      "title": "Backend",
      "skills": [
        {
          "name": "Python",
          "image": "https://www.python.org/static/favicon.ico"
        },
        {
          "name": "FastAPI",
          "image": "https://fastapi.tiangolo.com/img/favicon.png"
        },
        {
          "name": "Redis",
          "image": "https://raw.githubusercontent.com/devicons/devicon/master/icons/redis/redis-plain.svg"
        },
        {
          "name": "Postgresql",
          "image": "https://www.postgresql.org/favicon.ico"
        },
        {
          "name": "SQLAlchemy",
          "image": "https://www.sqlalchemy.org/favicon.ico"
        },
        {
          "name": "SQlite",
          "image": "https://raw.githubusercontent.com/devicons/devicon/master/icons/sqlite/sqlite-original.svg"
        },
        {
          "name": "MongoDB",
          "image": "https://raw.githubusercontent.com/devicons/devicon/ca28c779441053191ff11710fe24a9e6c23690d6/icons/mongodb/mongodb-original.svg"
        },
        {
          "name": "Kafka",
          "image": "https://raw.githubusercontent.com/devicons/devicon/ca28c779441053191ff11710fe24a9e6c23690d6/icons/apachekafka/apachekafka-original-wordmark.svg"
        },
        {
          "name": "RabbitMQ",
          "image": "https://raw.githubusercontent.com/devicons/devicon/ca28c779441053191ff11710fe24a9e6c23690d6/icons/rabbitmq/rabbitmq-original.svg"
        }
      ]
    },
    {
      "title": "Automation / Parsing",
      "skills": [
        {
          "name": "Selenium",
          "image": "https://www.selenium.dev/favicons/favicon.ico"
        },
        {
          "name": "Aiohttp",
          "image": "https://docs.aiohttp.org/en/stable/_static/favicon.ico"
        },
        {
          "name": "Httpx",
          "image": "https://www.python-httpx.org/assets/images/favicon.png"
        },
        {
          "name": "PyAutoGui",
          "image": "https://www.python.org/static/favicon.ico"
        },
        {
          "name": "Beautiful Soup",
          "image": "https://www.python.org/static/favicon.ico"
        },
        {
          "name": "Scrapy",
          "image": "https://scrapy.org/favicons/favicon-192x192.png"
        }
      ]
    },
    {
      "title": "Telegram / VK",
      "skills": [
        {
          "name": "Aiogram",
          "image": "https://aiogram.dev/favicon.ico"
        },
        {
          "name": "Pyrogram",
          "image": "https://docs.pyrogram.org/_static/img/pyrogram.png"
        },
        {
          "name": "VKBottle",
          "image": "https://vkbottle.readthedocs.io/ru/latest/logo.svg"
        }
      ]
    },
    {
      "title": "Working with OS/Servers",
      "skills": [
        {
          "name": "Arch Linux",
          "image": "https://archlinux.org/static/favicon.29302f683ff8.ico"
        },
        {
          "name": "Kali Linux",
          "image": "https://www.kali.org/images/favicon-dark.png"
        },
        {
          "name": "Ubuntu",
          "image": "https://assets.ubuntu.com/v1/be7e4cc6-COF-favicon-32x32.png"
        },
        {
          "name": "Debian",
          "image": "https://www.debian.org/favicon.ico"
        },
        {
          "name": "Fedora",
          "image": "https://fedoraproject.org/favicon.ico"
        }
      ]
    },
    {
      "title": "Others",
      "skills": [
        {
          "name": "Git",
          "image": "https://git-scm.com/favicon.ico"
        },
        {
          "name": "GitHub",
          "image": "https://github.githubassets.com/images/modules/logos_page/GitHub-Mark.png"
        },
        {
          "name": "GitLab",
          "image": "https://gitlab.com/assets/favicon-72a2cad5025aa931d6ea56c3201d1f18e68a8cd39788c7c80d5b2b82aa5143ef.png"
        },
        {
          "name": "Docker",
          "image": "https://www.docker.com/wp-content/uploads/2024/02/cropped-docker-logo-favicon-192x192.png"
        },
        {
          "name": "NeoVim",
          "image": "https://raw.githubusercontent.com/devicons/devicon/ca28c779441053191ff11710fe24a9e6c23690d6/icons/neovim/neovim-original.svg"
        },
        {
          "name": "VS Code",
          "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Visual_Studio_Code_1.35_icon.svg/512px-Visual_Studio_Code_1.35_icon.svg.png?20210804221519"
        },
        {
          "name": "PyCharm",
          "image": "https://github.com/devicons/devicon/raw/master/icons/pycharm/pycharm-plain.svg"
        },
        {
          "name": "Postman",
          "image": "https://www.postman.com/_ar-assets/images/favicon-1-32.png"
        }
      ]
    }
  ],
  "experiences": [
    {
      "id": 0,
      "img": "media/DuckMaster.jpeg",
      "role": "Team Lead, Python разработчик",
      "company": "Duck Master - Мини-игра в Telegram",
      "date": "Август 2024 — декабрь 2024",
      "desc": "Присоединившись к команде на этапе масштабных изменений в проекте (начало второго этапа разработки), я предложил CTO пересмотреть текущую архитектуру и начать второй этап с нуля.\nЭто решение было обосновано следующими проблемами:\n- Низкая производительность текущей системы, которая не справлялась с планируемым приростом аудитории в 5 миллионов игроков (подтверждено стресс-тестированием с использованием Java/Scala и Gatling).\n- Монолитная архитектура превратилась в \"спагетти-код\", что затрудняло поддержку и дальнейшее развитие проекта.\nПосле согласования мы спроектировали новую архитектуру, основанную на Event-Driven Architecture и Hexagonal Architecture, с использованием технологического стека: FastAPI, MongoDB, Kafka, Redis, Taskiq и других инструментов. Вся инфраструктура была развернута в AWS, а управление ею осуществляли DevOps-инженеры.\nОбязанности и достижения:\n- Проектирование и разработка микросервисов: Разделил бизнес-логику на независимые микросервисы, что значительно улучшило масштабируемость и скорость разработки.\n- Разработка API: Реализовал RESTful API на FastAPI, включая WebSocket-эндпоинт для игровой механики рулетки.\n- Работа с базами данных: Написал репозитории для MongoDB и Redis, обеспечив эффективное хранение и кеширование данных.\n- Тестирование: Разработал unit- и интеграционные тесты с использованием Pytest, а также провел нагрузочное тестирование с помощью Gatling.\n- Безопасность: Реализовал безопасную передачу данных через API с использованием RSA-шифрования.\n- Интеграция Kafka: Разработал микросервис для обновления данных в БД на основе логов из Kafka.\n- Взаимодействие с DevOps: Тесно сотрудничал с DevOps-командой для развертывания и настройки инфраструктуры в AWS, включая использование Docker и docker-compose для локальной и production-среды.\n- Внедрение лучших практик: Успешно внедрил Dependency Injection (DI) и Inversion of Control (IoC), что повысило тестируемость и поддерживаемость кода.\nРезультаты:\n- Успешная миграция с монолитной архитектуры на микросервисную, что улучшило масштабируемость и скорость разработки.\n- Повышена надежность и безопасность системы благодаря тесному взаимодействию с DevOps-командой и использованию облачной инфраструктуры AWS.\nТехнологический стек: Python, FastAPI, Aiogram, Redis, Kafka, MongoDB, TaskIQ, Git, GitLab, Docker, k8s, AWS.",
      "skills": [
        "Python",
        "FastAPI",
        "Aiogram",
        "Redis",
        "Kafka",
        "MongoDB",
        "TaskIQ",
        "Git",
        "GitLab",
        "Docker",
        "k8s",
        "AWS"
      ]
    },
    {
      "id": 1,
      "img": "media/Poeboto.jpeg",
      "role": "Team Lead, Python разработчик",
      "company": "Poeboto",
      "date": "Август 2022 — июль 2024",
      "desc": "Стартап предоставляет сервис для накрутки активности в Telegram (с планами расширения на другие платформы).\nПрисоединившись к проекту, он уже набирал обороты, но испытывал серьёзные проблемы с производительностью и поддержкой кодовой базы. Проект был построен на стеке: Django, PostgreSQL, Celery, Redis. Интерфейс был реализован с использованием шаблонов Jinja, что ограничивало возможности для масштабирования и улучшения пользовательского опыта.\nПосле ухода предыдущего разработчика я остался единственным техническим специалистом в команде. Кодовая база была плохо документирована.\nВместе с основателем проекта мы приняли решение о полной переработке архитектуры. Я выступил инициатором перехода на новый технологический стек: FastAPI, PostgreSQL, Taskiq, Redis, Kafka для бэкенда и React.js для фронтенда. Для реализации фронтенда был нанят отдельный разработчик.\nОбязанности и достижения:\n- Проектирование и разработка новой архитектуры: Переработал монолитную архитектуру на микросервисную, что улучшило масштабируемость и производительность системы.\n- Разработка API: Реализовал RESTful API на FastAPI, обеспечив высокую производительность и удобство интеграции с фронтендом.\n- Работа с базами данных: Оптимизировал работу с PostgreSQL и Redis, включая настройку индексов и кеширование для повышения отказоустойчивости.\n- Интеграция Kafka: Разработал микросервис для обработки событий и асинхронных задач с использованием Kafka, что улучшило отзывчивость системы.\n- Тестирование: Разработал unit- и интеграционные тесты с использованием Pytest, а также провёл нагрузочное тестирование для оценки производительности системы.\n- Безопасность: Реализовал безопасную передачу данных через API с использованием JWT-токенов.\n- Управление командой: Организовал работу команды из двух разработчиков, внедрив ежедневные стендапы и код-ревью, что ускорило разработку и улучшило качество кода.\n- Разработка специализированного сервиса: Создал сервис, имитирующий поведение реальных пользователей (публикация фото, участие в переписках, оставление комментариев), что повысило реалистичность и эффективность сервиса.\n- Внедрение лучших практик: Успешно внедрил Dependency Injection (DI) и Inversion of Control (IoC), что повысило тестируемость и поддерживаемость кода.\nРезультаты:\n- Успешный запуск MVP новой версии через месяц после начала переработки архитектуры.\n- Улучшение производительности и масштабируемости системы, что позволило справляться с растущей нагрузкой.\n- Повышение реалистичности и эффективности сервиса благодаря разработке специализированного сервиса для имитации поведения пользователей.\n- Упрощение поддержки и дальнейшего развития проекта за счёт перехода на микросервисную архитектуру и внедрения современных технологий.\nТехнологический стек: Python, FastAPI, Pydantic, Aiogram, Redis, Kafka, TaskIQ, PostgreSQL, SQLAlchemy, Httpx, Telethon, pytest, Git, GitLab, Docker, Postman, Ubuntu, Nginx, React.js.",
      "skills": [
        "Python",
        "FastAPI",
        "Pydantic",
        "Aiogram",
        "Redis",
        "Kafka",
        "TaskIQ",
        "PostgreSQL",
        "SQLAlchemy",
        "Httpx",
        "Telethon",
        "pytest",
        "Git",
        "GitLab",
        "Docker",
        "Postman",
        "Ubuntu",
        "Nginx",
        "React.js"
      ]
    },
    {
      "id": 2,
      "img": "media/AvTools.png",
      "role": "Team Lead, Python разработчик",
      "company": "AvTools",
      "date": "Ноябрь 2020 — июль 2022",
      "desc": "Интеграция с Авито для управления множеством аккаунтов, сбора статистики и других задач.\nОбязанности и достижения:\n- Проектирование микросервисов: Участвовал в переходе от монолитной архитектуры к микросервисной, что повысило масштабируемость и упростило поддержку системы.\n- Разработка API на Python: Создал API для микросервисов с использованием FastAPI и aiohttp, обеспечив высокую производительность и отзывчивость.\n- Работа с базами данных: Использовал PostgreSQL и SQLAlchemy для эффективного управления данными, включая оптимизацию запросов и настройку индексов.\n- Валидация данных: Реализовал схемы валидации данных с помощью Pydantic, что повысило надёжность и безопасность системы.\n- Настройка инфраструктуры: Настроил авторизацию и проксирование данных с помощью Nginx, а также конфигурации Docker и Docker Compose для развертывания и управления приложениями.\n- Тестирование и код-ревью: Разработал unit- и интеграционные тесты с использованием Pytest, проводил код-ревью, слияние веток и деплой.\nРезультаты:\n- Успешный переход от монолитной архитектуры к микросервисной, что улучшило масштабируемость и упростило дальнейшее развитие проекта.\n- Создание высоконагруженного микросервиса «Автоответчик», способного эффективно обрабатывать большие объемы запросов.\n- Повышение производительности и безопасности системы за счёт внедрения современных технологий и лучших практик.\nТехнологический стек: Python, Django, FastAPI, Pydantic, Aiogram, Redis, Celery, Kafka, PostgreSQL, SQLAlchemy, Scrapy, Selenium, Beautiful Soup, Aiohttp, pytest, Git, GitHub, Docker, Ubuntu, Nginx.",
      "skills": [
        "Python",
        "Django",
        "FastAPI",
        "Pydantic",
        "Aiogram",
        "Redis",
        "Celery",
        "Kafka",
        "PostgreSQL",
        "SQLAlchemy",
        "Scrapy",
        "Selenium",
        "Beautiful Soup",
        "Aiohttp",
        "pytest",
        "Git",
        "GitHub",
        "Docker",
        "Ubuntu",
        "Nginx"
      ]
    },
    {
      "id": 3,
      "img": "media/Kwork.png",
      "role": "Python разработчик",
      "company": "Kwork - Фриланс маркетплейс.",
      "date": "Январь 2020 — по настоящее время",
      "desc": "За последние 4 года я успешно работал фрилансером в качестве Python разработчика, специализируясь на backend-разработке с использованием Python, FastAPI, Redis, PostgreSQL, SQLAlchemy и SQLite. Также я активно занимался автоматизацией и парсингом данных с помощью Selenium, Aiohttp, Httpx, PyAutoGui, Beautiful Soup и Scrapy.\nВ области разработки Telegram и VK ботов я использовал Aiogram, Pyrogram и VKBottle. Работая с операционными системами и серверами, я имел опыт использования Arch Linux, Kali Linux, Ubuntu, Debian и Fedora.\nСреди других навыков и инструментов, которыми я владею: Git, GitHub, Docker, VS Code, PyCharm и Postman.",
      "skills": [
        "Httpx",
        "Redis",
        "Python",
        "Scrapy",
        "SQlite",
        "Aiohttp",
        "Ubuntu",
        "Aiogram",
        "FastAPI",
        "Selenium",
        "Pyrogram",
        "VKBottle",
        "PyAutoGui",
        "Postgresql",
        "SQLAlchemy",
        "Beautiful Soup",
        "Git",
        "Fedora",
        "GitHub",
        "Debian",
        "Docker",
        "VS Code",
        "PyCharm",
        "Postman",
        "Kali Linux",
        "Arch Linux"
      ]
    }
  ],
  "projects": [
    {
      "id": 0,
      "title": "FastAPI Template",
      "date": "Январь 2024",
      "description": "Шаблон для создания backend app на основе FastAPI",
      "image": "https://fastapi.tiangolo.com/img/logo-margin/logo-teal.png",
      "tags": [
        "Python",
        "FastAPI",
        "Pydantic",
        "SQLAlchemy"
      ],
      "category": "Backend",
      "github": "https://github.com/FastCodeProfile/FastAPI_Template",
      "webapp": "https://github.com/FastCodeProfile/FastAPI_Template",
      "member": [
        {
          "name": "Fast Code (Creator, Developer)",
          "img": "https://avatars.githubusercontent.com/u/95887682?v=4",
          "github": "https://github.com/FastCodeProfile"
        }
      ]
    },
    {
      "id": 1,
      "title": "AvTools",
      "date": "Декабрь 2023",
      "description": "AvTools - комплекс инструментов для работы с Avito. AV-MESSAGE - Инструмент, позволяющий автоматизировать коммуникацию с клиентами и увеличить продажи. AV-PRICE - Инструмент, позволяющий отслеживать цену за клик при тарифе CPC. AV-WORDSTAT - Инструмент, позволяющий отслеживать количество поисковых запросов по категориям. AV-NOTIFY - Инструмент позволяющий отслеживать новые объявления с задержкой до 1 минуты. AV-SPOOLING 2024 - Инструмент, позволяющий накрутить поведенческие факторы и увеличить трафик.",
      "image": "https://av-tools.net/wp-content/uploads/2024/03/logo-new.svg",
      "tags": [
        "Httpx",
        "Redis",
        "Python",
        "Scrapy",
        "Aiohttp",
        "Ubuntu",
        "Aiogram",
        "FastAPI",
        "Selenium",
        "Postgresql",
        "SQLAlchemy",
        "Beautiful Soup",
        "Git",
        "GitHub",
        "GitLab",
        "Docker"
      ],
      "category": "Backend",
      "webapp": "https://av-tools.net/",
      "member": [
        {
          "name": "Fast Code (TL, Developer)",
          "img": "https://avatars.githubusercontent.com/u/95887682?v=4",
          "github": "https://github.com/FastCodeProfile"
        },
        {
          "name": "Seliverstov Arseny (Developer)",
          "img": "https://avatars.githubusercontent.com/u/67968946?v=4",
          "github": "https://github.com/aSel1x"
        }
      ]
    },
    {
      "id": 2,
      "title": "Poeboto",
      "date": "Март 2023",
      "description": "За последний год я активно участвовал в разработке сервиса для управления трафиком в мессенджере Telegram, выполняя роль ведущего разработчика на Python для backend. Кроме того, я выполнял обязанности Team Lead, координируя и контролируя работу как backend, так и frontend разработчиков, обеспечивая эффективное взаимодействие и процесс разработки.",
      "image": "https://www.poeboto.ru/images/logo.svg",
      "tags": [
        "Python",
        "FastAPI",
        "Pydantic",
        "SQLAlchemy"
      ],
      "category": "Backend",
      "webapp": "https://www.poeboto.ru/",
      "member": [
        {
          "name": "Fast Code (TL, Developer)",
          "img": "https://avatars.githubusercontent.com/u/95887682?v=4",
          "github": "https://github.com/FastCodeProfile"
        },
        {
          "name": "Seliverstov Arseny (Developer)",
          "img": "https://avatars.githubusercontent.com/u/67968946?v=4",
          "github": "https://github.com/aSel1x"
        }
      ]
    }
  ]
}
